{"isbn":null,"title":"Kafka on the Shore by Haruki Murakami","authors":["Haruki Murakami"],"summary":"Paperback","cover":"https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1696957225i/129446867.jpg","genres":["Literary Fiction","Fiction","Literature","Classics","Magical Realism","Japanese Literature","Book Club","Fantasy","Audiobook","Novels"],"year":1104566400000,"rating":[8040,21210,80075,197194,210380]}
{"isbn":"0440236924","title":"Kaleidoscope","authors":["Danielle Steel"],"summary":"When a beautiful young Frenchwoman and a brilliant American actor meet in wartime Paris, their love begins like a fairy tale but ends in tragedy. Suddenly orphaned, their three children are cruelly separated. Megan, the baby, adopted by a family of comfortable means, becomes doctor in the rural Appalachia. Alexandra, raised in lavish wealth, marries a powerful man whose pride is his pedigree and who assumes that Alexandra is her parents' natural offspring. Neither of them has the remotest suspicion that she is adopted, or what turbulent tragedy lurks in her past. And Hilary, oldest of the Walker children, remembers them all, and the grief that tore them apart and cast them into separate lives. Feeling the loss throughout her life, and unable to find her sisters, she builds an extraordinary career and has no personal life. When John Chapman, lawyer and prestigious private investigator, is asked to find these three women, he wonders why. Their parents' only friend, he did nothing to keep them together  as children and has been haunted by remorse all his life. The investigator follows a trail that leads from chic New York to Boston slums, from elegant Parisian salons to the Appalachian hills, to the place where the three sisters face each other and one more final, devastating truth before they can move on.","cover":"https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1173371736i/278102.jpg","genres":["Adult Fiction","Contemporary Romance","Romance","Novels","Contemporary","Drama","Adult","Chick Lit","Historical Fiction","Fiction"],"year":972716400000,"rating":[200,835,4169,5248,6116]}
{"isbn":"0316428469","title":"Kingdom of the Wicked","authors":["Kerri Maniscalco"],"summary":"Two sisters.One brutal murder.A quest for vengeance that will unleash Hell itself...And an intoxicating romance.Emilia and her twin sister Vittoria are streghe - witches who live secretly among humans, avoiding notice and persecution. One night, Vittoria misses dinner service at the family's renowned Sicilian restaurant. Emilia soon finds the body of her beloved twin...desecrated beyond belief. Devastated, Emilia sets out to find her sister's killer and to seek vengeance at any cost—even if it means using dark magic that's been long forbidden.Then Emilia meets Wrath, one of the Wicked—princes of Hell she has been warned against in tales since she was a child. Wrath claims to be on Emilia's side, tasked by his master with solving the series of women's murders on the island. But when it comes to the Wicked, nothing is as it seems...","cover":"https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1578938260l/52735921.jpg","genres":["Paranormal","Romantasy","Enemies To Lovers","Mystery","Fantasy Romance","Young Adult Fantasy","Magic","Young Adult","Fiction","Witches"],"year":1603782000000,"rating":[6573,20405,78916,132160,95656]}
{"isbn":null,"title":"Kalona's Fall","authors":["Kristin Cast","P.C. Cast"],"summary":"In KALONA'S FALL, the shadows in Kalonas past will finally come to light We will learn about the winged immortal's secret history and discover how he went from being the Goddess's Warrior and Guardian to her enemy and betrayer. Did Darkness taint Kalona as it did Neferet, or has the powerful immortal always preferred power over honor, and control over faith? This novella will be crucial to fans' understanding of Kalona, before his role in the explosive final installment of the House of Night, REDEEMED.","cover":"https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1384283250i/16136628.jpg","genres":["Paranormal","Supernatural","Romance","Fantasy","Novella","Vampires","Magic","Young Adult","Fiction","Paranormal Romance"],"year":1406617200000,"rating":[142,457,1492,2037,3220]}
{"isbn":"0593530063","title":"Kapaemahu","authors":["Joe Wilson","Daniel Sousa","Hinaleimoana Wong-Kalu","Dean Hamer"],"summary":"An Indigenous legend about how four extraordinary individuals of dual male and female spirit, or Mahu, brought healing arts from Tahiti to Hawaii, based on the Oscar Award-contending short film.   In the 15th Century, four Mahu sail from Tahiti to Hawaii and share their gifts of science and healing with the people of Waikiki. The islanders return this gift with a monument of four boulders in their honor, which the Mahu imbue with healing powers before disappearing.As time passes, foreigners inhabit the island and the once sacred stones are forgotten until the 1960s. Though the true story of these stones was not fully recovered, the power of the Mahu still calls out to those who pass by them at Waikiki Beach today. With illuminating words and stunning illustrations by Hinaleimoana Wong-Kalu, Dean Hamer, Joe Wilson, and Daniel Sousa, KAPAEMAHU is a monument to an Indigenous Hawaiian legend and a classic in the making.","cover":"https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1632076541i/58988439.jpg","genres":["Picture Books","Folklore","Mythology","Queer","Nonfiction","Indigenous","History","LGBT","Gender","Childrens"],"year":1654585200000,"rating":[1,17,86,297,504]}
{"isbn":null,"title":"Kandinsky: The First Abstract Watercolour Painting (One Hundred Paintings) by Federico Zeri","authors":["Federico Zeri"],"summary":"Focusing on his \"First Abstract Watercolour,\" chronicles the artist's experimentations with form, color and technique, and examines his educational background and influences as he traveled between Russia, Germany and France.","cover":"https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1694926620i/171209225.jpg","genres":null,"year":null,"rating":[0,0,0,1,0]}
{"isbn":"1481477676","title":"Kaleidoscope Song","authors":["Fox Benwell"],"summary":"South Africa is loud. Listen. Do you hear the song and dance of it? The chorus of Khayelitsha life? Every voice is different, its pitch and tone and intonation as distinct as the words we choose and how we wrap our mouths around them. But everybody has a voice, and everybody sings…Fifteen year old Neo loves music, it punctuates her life and shapes the way she views the world. A life in radio is all she’s ever wanted.When Umzi Radio broadcasts live in a nearby bar Neo can’t resist. She sneaks out to see them, and she falls in love, with music, and the night, but also with a girl: Tale has a voice like coffee poured into a bright steel mug, and she commands the stage.It isn’t normal. Isn’t right. Neo knows that she’s supposed to go to school and get a real job and find a nice young boy to settle down with. It’s written everywhere – in childhood games, and playground questions, in the textbooks, in her parents’ faces. But Tale and music are underneath her skin, and try as she might, she can’t stop thinking about them.","cover":"https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1486396504i/29620980.jpg","genres":["Africa","Romance","Contemporary","Queer","Unfinished","LGBT","Music","Gay","Young Adult","Fiction"],"year":1505804400000,"rating":[10,18,74,113,83]}
{"isbn":"0062643835","title":"Kate in Waiting","authors":["Becky Albertalli"],"summary":"From bestselling YA rom-com queen Becky Albertalli, author of Simon vs the Homo Sapiens Agenda (Love, Simon), comes a new novel about daring to step out of the shadows and into the spotlight in love, life and, yes, theatre.Contrary to popular belief, best friends Kate Garfield and Anderson Walker are not codependent. Carpooling to and from theatre rehearsals? Environmentally sound and efficient. Consulting each other on every single life decision? Basic good judgment. Pining for the same guys from afar? Shared crushes are more fun anyway.But when Kate and Andy's latest long-distance crush shows up at their school, everything goes off-script. Matt Olsson is talented and sweet, and Kate likes him. She really likes him. The only problem? So does Anderson. Turns out, communal crushes aren't so fun when real feelings are involved. This one might even bring the curtains down on Kate and Anderson's friendship.","cover":"https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1599810921i/48579405.jpg","genres":["Realistic Fiction","Romance","Contemporary","Friendship","Queer","Young Adult Contemporary","LGBT","Audiobook","Young Adult","Fiction"],"year":1618902000000,"rating":[180,692,3204,4743,2826]}
